#### Data Merging

In [25]:
# pd.merge(data1, data2, on="ID") -> Merge on basis of a specific column 
# thats in both databases e.g ID
import pandas as pd

In [26]:
data1 = {
    'id': [1, 2, 3],
    'Name': ["Sardar", "Shahzad", "Shahzeb"],
    'Age': [20, 17, 10]
}
df1 = pd.DataFrame(data1)
df1

   id     Name  Age
0   1   Sardar   20
1   2  Shahzad   17
2   3  Shahzeb   10

In [27]:
data2 = {
    'id': [1, 2, 3],
    'City': ["Karachi", "Karachi", "Karachi"],
    'Occupation': ["ML Engineer", "Student", "Student"]
}
df2 = pd.DataFrame(data2)
df2

   id     City   Occupation
0   1  Karachi  ML Engineer
1   2  Karachi      Student
2   3  Karachi      Student

In [28]:
merged_data = pd.merge(df1, df2, on="id", how="inner")

In [29]:
merged_data

   id     Name  Age     City   Occupation
0   1   Sardar   20  Karachi  ML Engineer
1   2  Shahzad   17  Karachi      Student
2   3  Shahzeb   10  Karachi      Student

#### Data Concatentation

In [31]:
import pandas as pd

data1 = {'Name': ['Ahmed', 'Fatima', 'Ali'], 'Age': [28, 32, 24]}

data2 = {'Name': ['Sara', 'Usman', 'Aisha'], 'Age': [29, 35, 27]}

data3 = {'City': ['Karachi', 'Lahore', 'Islamabad'], 'Province': ['Sindh', 'Punjab', 'Islamabad']}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3 = pd.DataFrame(data3)

In [37]:
concatenatedRows_data = pd.concat([df1, df2])
concatenatedRows_data

     Name  Age
0   Ahmed   28
1  Fatima   32
2     Ali   24
0    Sara   29
1   Usman   35
2   Aisha   27

In [39]:
concatenated_data = pd.concat([concatenatedRows_data, df3], axis=1)
print(concatenated_data)

     Name  Age       City   Province
0   Ahmed   28    Karachi      Sindh
1  Fatima   32     Lahore     Punjab
2     Ali   24  Islamabad  Islamabad
0    Sara   29    Karachi      Sindh
1   Usman   35     Lahore     Punjab
2   Aisha   27  Islamabad  Islamabad

#### Drop Duplicates

In [40]:
data = {
    "id": [1, 2, 3, 4, 5, 3, 2, 6, 7, 4, 8],
    "name": ["Alice", "Bob", "Charlie", "David", "Eva", "Charlie", "Bob", "Frank", "Grace", "David", "Hannah"],
    "marks": [85, 90, 75, 80, 95, 75, 90, 88, 92, 80, 85],
    "class": ["X", "X", "Y", "X", "Y", "Y", "X", "Z", "Y", "X", "Z"]
}

df = pd.DataFrame(data)
print(df)

    id     name  marks class
0    1    Alice     85     X
1    2      Bob     90     X
2    3  Charlie     75     Y
3    4    David     80     X
4    5      Eva     95     Y
5    3  Charlie     75     Y
6    2      Bob     90     X
7    6    Frank     88     Z
8    7    Grace     92     Y
9    4    David     80     X
10   8   Hannah     85     Z

In [42]:
df = df.drop_duplicates(subset="name")

In [43]:
df

    id     name  marks class
0    1    Alice     85     X
1    2      Bob     90     X
2    3  Charlie     75     Y
3    4    David     80     X
4    5      Eva     95     Y
7    6    Frank     88     Z
8    7    Grace     92     Y
10   8   Hannah     85     Z